# Element1D

Representation of element1D

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.element1_d import Element1D

# TODO update the JSON string below
json = "{}"
# create an instance of Element1D from a JSON string
element1_d_instance = Element1D.from_json(json)
# print the JSON string representation of the object
print(Element1D.to_json())

# convert the object into a dict
element1_d_dict = element1_d_instance.to_dict()
# create an instance of Element1D from a dict
element1_d_from_dict = Element1D.from_dict(element1_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)